## Formatting the data (exchange rate)

In [1]:
import pandas as pd

### Import data in .csv format and delete unnecessary data

In [2]:
df = pd.read_csv('ert_bil_eur_m_page_linear.csv')
# source: https://ec.europa.eu/eurostat/databrowser/view/ERT_BIL_EUR_M__custom_7179516/default/table?lang=en

In [3]:
df.head()

,DATAFLOW,LAST UPDATE,freq,statinfo,unit,currency,TIME_PERIOD,OBS_VALUE,OBS_FLAG
0,ESTAT:ERT_BIL_EUR_M(1.0),04/08/23 11:00:00,M,AVG,NAC,USD,1996-01,1.2918,NaN
1,ESTAT:ERT_BIL_EUR_M(1.0),04/08/23 11:00:00,M,AVG,NAC,USD,1996-02,1.2886,NaN
2,ESTAT:ERT_BIL_EUR_M(1.0),04/08/23 11:00:00,M,AVG,NAC,USD,1996-03,1.2813,NaN
3,ESTAT:ERT_BIL_EUR_M(1.0),04/08/23 11:00:00,M,AVG,NAC,USD,1996-04,1.2639,NaN
4,ESTAT:ERT_BIL_EUR_M(1.0),04/08/23 11:00:00,M,AVG,NAC,USD,1996-05,1.2467,NaN

In [4]:
columns_to_delete = list(range(0,6))
df = df.drop(df.columns[columns_to_delete], axis=1)
df.drop('OBS_FLAG',axis=1,inplace=True)

In [5]:
df.head()

  TIME_PERIOD  OBS_VALUE
0     1996-01     1.2918
1     1996-02     1.2886
2     1996-03     1.2813
3     1996-04     1.2639
4     1996-05     1.2467

### Adjustment of column names

In [6]:
df.rename(columns={'TIME_PERIOD': 'Time'}, inplace=True)
df.rename(columns={'OBS_VALUE': 'Exchange_rate ($/€)'}, inplace=True)

In [7]:
df.head(1)

      Time  Exchange_rate ($/€)
0  1996-01               1.2918

### Saving the data

In [8]:
df.to_csv('C:/Users/Jakob/Desktop/Dataset/exchange_rate.csv')

In [9]:
df.head()

      Time  Exchange_rate ($/€)
0  1996-01               1.2918
1  1996-02               1.2886
2  1996-03               1.2813
3  1996-04               1.2639
4  1996-05               1.2467